def print_triangle(n):
    for i in range(n, 0, -1):
        print(str(i) * i)


print(print_triangle(5))


# Написать функцию, которая выводит треугольник из чисел